
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
КонецПроцедуры

&НаСервере
//Здесь загружается сохраненный пользователем в форме отбор/другие настройки списка-таблицы
//Описание:
//Вызывается при восстановлении пользовательских настроек, перед помещением настроек в компоновщик настроек. В обработчике можно изменить значения загружаемых настроек.
//Обработчик вызывается при открытии формы, если для таблицы имеются сохраненные настройки, а также при интерактивной загрузке настроек. 
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
Настройки.Элементы[0].Элементы[0].ПравоеЗначение = '20180101';
КонецПроцедуры
