
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Объект.СсылкаНаДок = Параметры.Ключ;
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКДереву(Команда)
	
	Корень = РеквизитДерево.ПолучитьЭлементы();	
	НовСтр = Корень.Добавить();
	НовСтр.Чис = 1;
	НовСтр.Стр = "Строка 1";
	СтрокиСтроки = НовСтр.ПолучитьЭлементы();
	НовСтр = СтрокиСтроки.Добавить();
	НовСтр.Чис = 1;
	НовСтр.Стр = "Строка 1.1";
	НовСтр = Корень.Добавить();
	НовСтр.Чис = 2;
	НовСтр.Стр = "Строка 2.1";
	
КонецПроцедуры     
