Процедура ТестоваяПроцедура() Экспорт

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "Сообщение из основной конфигурации";
Сообщение.Сообщить();	

КонецПроцедуры

Процедура ПодпискаНаСобытиеПроведениеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	//Источник.Движения.ДвиженияТоваров.Записать();
	//Источник.Движения.ДвиженияТоваров.Записывать = Ложь;
	а = "тестирование коммитов github новый коммит! Бля я это прямо на гите написал111 ";
КонецПроцедуры

Процедура ТестоваяПроцедура111() Экспорт

Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "Сообщение из общего серверного модуля";
Сообщение.Сообщить();	

КонецПроцедуры

Процедура ЗаполнитьКомментарий(Форма)  Экспорт
	
	Форма.Объект.Комментарий = "Заполнено в серверной процедуре общего модуля при передаче в нее формы";
	НовСтрока = Форма.РеквизитТабЧасть.Добавить();
	НовСтрока.КолонкаСтрока = "Заполнили на сервере";
	
КонецПРоцедуры	

Функция ТестСКД(Товар) ЭКспорт
	
	Значение = "";
	Для каждого эл ИЗ Товар.ТабличнаяЧасть1 Цикл
		Значение = Значение + эл.Реквизит1 + ";" + Символы.ПС;
	КонецЦикла;	
	
	Возврат Значение;
	

КонецФункции	

