
Процедура ПередНачаломРаботыСистемы(Отказ)
	//Возникает при старте 1С:Предприятия в режиме управляемого приложения 
	//до открытия главного окна. В процедуре-обработчике данного события могут быть 
	//выполнены необходимые проверки и, при необходимости, установлен параметр отказа 
	//от запуска программы. 
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	//Возникает при запуске 1С:Предприятия в режиме управляемого приложения после открытия 
	//главного окна. В процедуре-обработчике могут быть выполнены различные действия, 
	//необходимые при запуске программы, например, открыты некоторые формы. 
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()
	// Вставить содержимое обработчика.
КонецПроцедуры
