
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
КонецПроцедуры

//Вызывается при получении состава полей, из которых формируется представление объекта или ссылки.
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

КонецПроцедуры

//Вызывается при получении представления объекта или ссылки. 
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

КонецПроцедуры
