
&НаКлиенте
Процедура КомандаКонфигурации(Команда)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Сообщение основной конфигурации";
	Сообщение.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКнопкаДействия(Команда)
	
	ДействиеОсновнойКонфигурации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКнопкаДействияСначалаРасширение(Команда)
	ДействиеОсновнойКонфигурации();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеОсновнойКонфигурации()
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Действие основной конфигурации";
	Сообщение.Сообщить();
	
КонецПроцедуры	

&НаКлиенте
Процедура ВызовСервернойПроцедуры(Команда)
	ОбщийМодульСервер.ТестоваяПроцедура();
КонецПроцедуры
