
&НаКлиенте
Процедура ПодборТоваров(Команда)
	
	//Расширение управляемой формы для динамического списка.ФиксированныеНастройки (Managed form extension for dynamic lists.FixedSettings)
	//	Расширение управляемой формы для динамического списка (Managed form extension for dynamic lists)
	//		ФиксированныеНастройки (FixedSettings)
	//		Описание:
	//		
	//		Тип: НастройкиКомпоновкиДанных. 
	//		Настройки, помещаемые в фиксированные настройки отчета. 
			
	фНастройки = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = фНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Наименование");   
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = ПоискТовара; // сочетание букв наименования товара
	ПараметрыФ = Новый Структура("ФиксированныеНастройки", фНастройки);
	ФормаВыбораНоменклатуры = ПолучитьФорму("Справочник.Товары.ФормаВыбора", ПараметрыФ,Элементы.СписокТоваров);
	//ФормаВыбораНоменклатуры.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	ФормаВыбораНоменклатуры.Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокТоваровТоварНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Подбор через "параметры выбора" 
	СтандартнаяОбработка = истина;
	МассивПараметров = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Наименование" , "Айфон");
	МассивПараметров.Добавить(НовыйПараметр);
	ПарамВыбора = Новый ФиксированныйМассив(МассивПараметров);
	Элемент.ПараметрыВыбора = ПарамВыбора;
		
КонецПроцедуры

//Список выбора при вводе по строке
&НаКлиенте
Процедура СписокТоваровТоварАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
  СтандартнаяОбработка = Ложь;//без откл. стандартной обработки ничего не происходит...
  //Параметр позволяет отменить стандартное заполнение системой ДанныеВыбора. 
  //При этом все действия (отображение списка, предупреждения) выполняются системой на основе возвращенного значения 
  //параметра <ДанныеВыбора> независимо от значения параметра <СтандартнаяОбработка>.
  
  ДанныеВыбора = ПодборЭлементов();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодборЭлементов()
	
	СпЗ = Новый СписокЗначений;
	//СпЗ.Добавить(Справочники.Товары.НайтиПоНаименованию("ДляОтбора1"));
	СпЗ.Добавить(Справочники.Товары.НайтиПоНаименованию("ДляОтбора2"));
	СпЗ.Добавить(Справочники.Товары.НайтиПоНаименованию("Айфон"));
	Возврат СпЗ;
	
КонецФункции

&НаКлиенте
//Возникает на клиенте при повторном открытии формы. 
//Повторное открытие возникает при вызове метода Открыть для уже открытой формы.
Процедура ПриПовторномОткрытии()
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
//Возникает на клиенте при выборе объекта в одной из подчиненных форм или при вызове в одной из подчиненных форм метода ОповеститьОВыборе". 
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

КонецПроцедуры

&НаКлиенте
//Вызывается во всех созданных формах при вызове метода Оповестить. Параметры обработчика совпадают с параметрами метода Оповестить. 
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

КонецПроцедуры

&НаКлиенте
//Возникает на клиенте в подчиненной форме, если в форме-владельце изменился активный объект или в форме-владельце был вызван метод ОповеститьОбАктивизации. 
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)

КонецПроцедуры

&НаКлиенте
//Возникает на клиенте при записи объекта в одной из подчиненных форм или при вызове в одной из подчиненных форм метода ОповеститьОЗаписиНового.
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
//Вызывается при нажатии на гиперссылку форматированной строки, расположенной в элементе формы типа Расширение поля формы для поля надписи или в элементе формы Расширение декорации формы для надписи, у которого свойство Гиперссылка имеет значение Ложь. 
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
//Возникает на клиенте при вызове команды перехода к объекту или при вызове метода формы ВыполнитьПереход. 
//ВыполнитьПереход(Объект) - Если основным реквизитом формы является динамический список, и тип значения параметра Объект является ссылкой на объект, который содержится в главной таблице динамического списка,
//то у таблицы формы, отображающей этот динамический список ( первой, если таких таблиц несколько) текущая строка устанавливается на переданный объект.
Процедура ОбработкаПерехода(ОбъектПерехода, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварОчистка(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварОткрытие(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварСоздание(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровТоварОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ВызовСервернойПроцедуры(Команда)
		//ОбщийМодульСервер.ТестоваяПроцедура111();
		Сообщ();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Сообщ()
ОбщийМодульКлиентСервер.ТестоваяПроцедураКлиентСервер();
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокТоваровОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Элемент.ДобавитьСтроку();
	КонецЕсли;
	
	Элемент.ТекущиеДанные.Товар = ВыбранноеЗначение;

КонецПроцедуры

&НаКлиенте
Процедура ПередатьФормуНаСерверЗаполнитьКомментарий(Команда)
	
	//ВАЖНО!
	//ОбщийМодульСервер.ЗаполнитьКомментарий(ЭтаФорма);// Передаем форму на сервер
	//Если форму сразу из клиентской функции передавать в сервреную процедуру обзего модуля, будет ошибка:
	//***********************
	//	 Ошибка при вызове серверного метода.
	//по причине:
	//Ошибка передачи данных между клиентом и сервером. Значение недопустимого типа.
	//***********************
	
	//Если вызвать серверную процедуру из серверной процедуры формы, 
	//то она прекрасно уезжает в общий модуль, значения реквизитов меняются и возвращаются на клиент	
	ПередатьФормуНаСерверЗаполнитьКомментарийНаСервере(); //вызовем процедуру общего модуля из серверной процедуры формы(форма уезжает на сервер)
	
КонецПроцедуры

&НаСервере
Процедура ПередатьФормуНаСерверЗаполнитьКомментарийНаСервере()
	
	ОбщийМодульСервер.ЗаполнитьКомментарий(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестОшибки(Команда)
	ОбщийМодульКлиент.ТестОшибки(ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПросроченныйТовар(Команда)
	
УстановитьОтборНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборНаСервере()
	
	УстановитьОтборНаСервереБезКонтекста(ЭтотОбъект)

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОтборНаСервереБезКонтекста(Форма)
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Просроченный", Истина);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Форма.Элементы.СписокТоваровТовар2.ПараметрыВыбора = НовыеПараметры;

	
КонецПроцедуры	
