
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Комментарий = "Перед записью";
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Комментарий = "При записи"; //После записи будет отображаться на форме, но в базу запишется значение "Перед записью"
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
 f=1;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ДвиженияТоваров Приход
	Движения.ДвиженияТоваров.Записывать = Ложь;
	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
		Движение = Движения.ДвиженияТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСписокТоваров.Товар;
		Движение.Заказ = Заказ;
		Движение.Сумма = ТекСтрокаСписокТоваров.Цена;
		Движение.Цена = ТекСтрокаСписокТоваров.Цена;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
	КонецЦикла;
	Движения.ДвиженияТоваров.ЗАписать();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

КонецПроцедуры
